<html>
<head>

<title>Weighted Hardy-type inequalities involving fractional calculus operators</title>

<meta name="description" content="Rad HAZU, Vol.22, 77-91">

</head>

<!-- 
<body bgcolor="#FFDD77">
-->

<h4>Rad HAZU, Matemati&#269;ke znanosti, Vol. 22 (2018), 77-91.</h4>

<h3 align=center>WEIGHTED HARDY-TYPE INEQUALITIES INVOLVING FRACTIONAL CALCULUS OPERATORS</h3>
<h3 align=center>Sajid Iqbal, Josip Pe&#269;ari&#263;, Muhammad Samraiz and &#381;ivorad Tomovski</h3>

Department of Mathematics, University of Sargodha, Sub-Campus Mianwali, Mianwali, Pakistan <br>
<em>e-mail:</em> <tt>sajid_uos2000@yahoo.com, dr.sajid@uos.edu.pk</tt>
<p>
Faculty of Textile Technology, University of Zagreb, Zagreb, Croatia <br>
<em>e-mail:</em> <tt>pecaric@element.hr</tt>
<p>
Department of Mathematics, University of Sargodha, Sargodha, Pakistan <br>
<em>e-mail:</em> <tt>msamraiz@uos.edu.pk</tt>
<p>
Faculty of Mathematics and Natural Sciences, Gazi Baba bb, 1000 Skopje, Macedonia <br>
<em>e-mail:</em> <tt>tomovski@pmf.ukim.mk</tt>

<p>
<hr size=2 noshade>
<p>


<b>Abstract.</b> &nbsp; The aim of this paper is to give a new class of general
weighted Hardy-type inequalities involving an arbitrary convex function
with some applications of generalized fractional calculus convolutive operators
which contain Gauss-hypergeometric function, generalized Mittag-Leffler function 
and Hilfer fractional derivative operator, in the kernel.

<p>
<b>2010 Mathematics Subject Classification.</b> &nbsp; 
26D15, 26D10, 26A33, 34B27.
<p>
<b>Key words and phrases.</b> &nbsp; Inequalities, convex function, fractional derivatives, generalized
fractional integral operator. 
<p>

<hr size=2 noshade>

<a href="https://hrcak.srce.hr/file/303104"><b>Full text (PDF)</b></a> (free access)
<p>

DOI: <a href="https://doi.org/10.21857/ydkx2cr509">https://doi.org/10.21857/ydkx2cr509</a>

<hr size=2 noshade>
<p>
<b>References:</b>
<small>
<ol>

<li> A. &#268;i&#382;me&#353;ija, K. Kruli&#263; and J. Pe&#269;ari&#263;, 
<i>On a new class of refined discrete Hardy-type inequalities</i>, Banach J. Math. Anal. <b>4</b> (2010), 122-145.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2628811">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.15352/bjma/1272374676">CrossRef</a>
<p>

<li> A. &#268;i&#382;me&#353;ija, K. Kruli&#263; and J. Pe&#269;ari&#263;, 
<i>Some new refined Hardy-type inequalities with kernels</i>, J. Math. Inequal. <b>4</b> (2010), 481-503.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2777287">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.7153/jmi-04-44">CrossRef</a>
<p>

<li> A. &#268;ižmešija, K. Kruli&#263; and J. Pe&#269;ari&#263;, 
<i>A new class of general refined Hardy type inequalities
with kernels</i>, Rad Hrvat. Akad. Znan. Umjet. Mat. Znan. <b>17</b> (2013), 53–80.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=3100225">MathSciNet</a> 
<p>

<li> L. Curiel and L. Galue, <i>A generalization of the integral operators involving the Gauss
hypergeometric function</i>, Rev. T&eacute;cn. Fac. Ingr. Univ. Zulia <b>19</b> (1996), 17–22.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=1390021">MathSciNet</a> 
<p>

<li> N. Elezovi&#263;, K. Kruli&#263; and J. Pe&#269;ari&#263;, 
<i>Bounds for Hardy type differences</i>, Acta Math.
Sin. (Engl. Ser.) <b>27</b> (2011), 671–684.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2776404">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.1007/s10114-011-9707-5">CrossRef</a>
<p>

<li> I. S. Gradshteyn and I. M. Ryzhik, Table of Integrals, Series, and Products, Seventh
Edition, Elsevier Inc., Amsterdam, 2007.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2360010">MathSciNet</a> 
<p>

<li> R. Hilfer, Y. Luchko and &#381;. Tomovski, <i>Operational method for solution of fractional
differential equations with generalized Riemann-Liouville fractional derivative</i>, Fract.
Calc. Appl. Anal. <b>12</b> (2009), 299–318.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2572712">MathSciNet</a> 
<p>

<li> S. Iqbal, K. Kruli&#263; Himmelreich and J. Pe&#269;ari&#263;, 
<i>A new class of Hardy-type integral inequalities</i>, Math. Balkanica (N. S.) <b>28</b>, Fasc. 1-2, (2014), 3-16. 
<p>

<li> S. Iqbal, K. Kruli&#263; Himmelreich and J. Pe&#269;ari&#263;, 
<i>On a new class of Hardy-type inequalities with fractional integrals and fractional derivatives</i>, 
Rad Hrvat. Akad. Znan. Umjet. Mat. Znan. <b>18</b> (2014) 91–105.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=3333821">MathSciNet</a> 
<p>

<li> S. Iqbal, J. Pe&#269;ari&#263;, M. Samraiz and &#381;. Tomovski, 
<i>Hardy-type inequalities for generalized fractional integral operators</i>, Tbil. Math. J. <b>10</b> (2017), 75–90.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=3607267">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.1515/tmj-2017-0005">CrossRef</a>
<p>

<li> S. Kaijser, L. Nikolova, L.-E. Persson and A. Wedestig, Hardy type inequalities via
convexity, Math. Inequal. Appl. 8 (2005), 403–417.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2148234">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.7153/mia-08-38">CrossRef</a>
<p>

<li> K. Kruli&#263;, J. Pe&#269;ari&#263; and L.-E. Persson, 
<i>Some new Hardy-type inequalities with general kernels</i>, Math. Inequal. Appl. <b>12</b> (2009), 473–485.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2540971">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.7153/mia-12-36">CrossRef</a>
<p>

<li> K. Kruli&#263;, J. Pe&#269;ari&#263; and D. Pokaz, 
Inequalities of Hardy and Jensen, Zagreb, Element, 2013.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=v">MathSciNet</a> 
<p>

<li> G. M. Mittag-Leffler, <i>Sur la nouvelle fonction</i>, C. R. Acad. Sci. Paris. <b>137</b> (1903),
554–558.
<p>

<li> T. R. Prabhakar, <i>A singular integral equation with a generalized Mittag-Leffler function
in the kernel</i>, Yokohama Math. J. <b>19</b> (1971), 7–15.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=0293349">MathSciNet</a> 
<p>

<li> T. O. Salim, <i>Some properties relating to the generalized Mittag-Leffler function</i>, 
Adv. Appl. Math. Anal. <b>4</b> (2009), 21–30.
<p>

<li> T. O. Salim and A. W. Faraj, <i>A generalization of Mittag-Leffler function and integral
operator associated with fractional calculus</i>, J. Fract. Calc. Appl. <b>5</b> (2012), 1-13.
<p>

<li> A. K. Shukla and J. C. Prajapati, <i>On a generalization of Mittag-Leffler function and
its properties</i>, J. Math. Anal. Appl. <b>336</b> (2007), 797–811.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2352981">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.1016/j.jmaa.2007.03.018">CrossRef</a>
<p>

<li> H. M. Srivastava and &#381;. Tomovski, <i>Fractional calculus with an integral operator containing
generalized Mittag-Leffler function in the kernal</i>, Appl. Math. Comput. <b>211</b> 
(2009), 198–210.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2517679">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.1016/j.amc.2009.01.055">CrossRef</a>
<p>

<li> &#381;. Tomovski, R. Hilfer and H. M. Srivastava, <i>Fractional and Operational Calculus
with Generalized Fractional Derivative Operators and Mittag-Leffler Type Functions</i>,
Integral Transforms Spec. Funct. <b>21</b> (2010), 797-814.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=2739389">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.1080/10652461003675737">CrossRef</a>
<p>

<li> A. Wiman, <i>&Uuml;ber den fundamentalsatz in der theorie der functionen</i>, Acta Math. <b>29</b> 
(1905), 191–201.
<br>
<a href="http://www.ams.org/mathscinet-getitem?mr=1555014">MathSciNet</a> &nbsp; &nbsp; 
<a href="http://dx.doi.org/10.1007/10.1007/BF02403202">CrossRef</a>
<p>


</ol>
</small>

<hr size=2 noshade>

<a href="http://web.math.pmf.unizg.hr/~duje/radhazumz/"><em>Rad HAZU</em> Home Page</a>

</body>

</html>

