<html>
<head>

<title>Equisegmentary lines of a triangle in the isotropic plane</title>

<meta name="description" content="Rad HAZU, Vol.26, 171-187">

</head>

<!-- 
<body bgcolor="#FFDD77">
-->

<h4>Rad HAZU, Matemati&#269;ke znanosti, Vol. 26 (2022), 171-187.</h4>

<h3 align=center>EQUISEGMENTARY LINES OF A TRIANGLE IN THE ISOTROPIC PLANE</h3>
<h3 align=center>Ru&#382;ica Kolar-&#352;uper</h3>

Faculty of Education, University of Osijek, 
31 000 Osijek, Croatia <br>
<em>e-mail:</em> <tt>rkolar@foozos.hr</tt>

<p>
<hr size=2 noshade>
<p>


<b>Abstract.</b> &nbsp; In this paper we introduce the concept of equisegmentary
lines in the isotropic plane. We derive the equations of equisegmentary lines
for a standard triangle and prove that the angle between them is equal to
the Brocard angle of a standard triangle. We study the dual Brocard circle,
the circle whose tangents are equisegmentary lines, as well as the inertial
axis and the Steiner axis. Some interesting properties of this circle are also
investigated.

<p>
<b>2020 Mathematics Subject Classification.</b> &nbsp; 
51N25.
<p>
<b>Key words and phrases.</b> &nbsp; Isotropic plane, equisegmentary lines, Brocard angle, dual
Brocard circle.
<p>

<hr size=2 noshade>

<a href="https://hrcak.srce.hr/file/410946"><b>Full text (PDF)</b></a> (free access)
<p>

DOI: <a href="https://doi.org/10.21857/ypn4ocdlj9">https://doi.org/10.21857/ypn4ocdlj9</a>

<hr size=2 noshade>
<p>
<b>References:</b>
<small>
<ol>

<li> J. Beban-Brki&#263;, R. Kolar-&#352;uper, Z. Kolar-Begovi&#263; and V. Volenec, <i>On Feuerbach's theorem
and a pencil of circles in the isotropic plane</i>, J. Geom. Graphics <b>10</b> (2006),
125-132.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2324588">MathSciNet</a> 
<p>

<li> J. Beban-Brki&#263;, V. Volenec, Z. Kolar-Begovi&#263; and R.Kolar-&#352;uper, <i>On Gergonne point
of the triangle in isotropic plane</i>, Rad Hrvat. Akad. Znan. Umjet. Mat. Znan. <b>17</b>
(2013), 95-106.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=3100227">MathSciNet</a> 
<p>

<li> Z. Kolar-Begović, R. Kolar-&#352;uper and V. Volenec, <i>Brocard angle of the standard triangle
in an isotropic plane</i>, Rad Hrvat. Akad. Znan. Umjet. Mat. Znan. <b>16</b> (2018),
55-66.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2761546">MathSciNet</a> 
<p>

<li> Z. Kolar-Begovi&#263;, R. Kolar-&#352;uper, J. Beban-Brki&#263; and V.Volenec, <i>Symmedians and the
symmedian center of the triangle in an isotropic plane</i>, Math. Pannon. <b>17</b> (2006),
287-301.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2272902">MathSciNet</a> 
<p>

<li> Z. Kolar-Begovi&#263;, R. Kolar-&#352;uper and V. Volenec, <i>Angle bisectors of a triangle in I<sub>2</sub></i>,
Math. Commun. <b>13</b> (2008), 97-105.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2422092">MathSciNet</a> 
<p>

<li> Z.Kolar-Begovi&#263;, R. Kolar-&#352;uper and V. Volenec, <i>Brocard circle of the triangle in an
isotropic plane</i>, Math. Pannon. <b>26</b> (2017-2018), 103-113.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=3888128">MathSciNet</a> 
<p>

<li> R. Kolar-&#352;uper, Z. Kolar-Begovi&#263;, V. Volenec and J. Beban-Brki&#263;, <i>Metrical relationships
in a standard triangle in an isotropic plane</i>, Math. Commun. <b>10</b> (2005), 149-157.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2199105">MathSciNet</a> 
<p>

<li> J. Neuberg, <i>Bibliographie du triangle et du t&eacute;tra&egrave;dre</i>, Mathesis <b>36</b> (1922), 50.
<p>

<li> M. d' Ocagne, <i>A propos d'une note r&eacute;cente sur le triangle</i>, Mathesis (1888), 131-132.
<p>

<li> M. d' Ocagne, <i>Quelques propri&eacute;t&eacute;s du triangle</i>, Mathesis (1887), 265-271.
<p>

<li> H. Sachs, Ebene isotrope Geometrie. Vieweg–Verlag, Braunschweig, Wiesbaden 1987.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=908294">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.1007/978-3-322-84150-6">CrossRef</a>
<p>

<li> K. Strubecker, <i>Geometrie in einer isotropen Ebene</i>, Mathematischer und naturwissenschaftlicher
Unterricht <b>15</b> (1962-1963), 297-306, 343-351, 385-394.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=147954">MathSciNet</a> 
<p>

<li> V. Volenec, Z. Kolar-Begovi&#263; and R. Kolar-&#352;uper, <i>Crelle-Brocard points of the triangle
in an isotropic plane</i>, Math. Pannon. <b>24</b> (2013), 167-181.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=3362432">MathSciNet</a> 
<p>

<li> V. Volenec, Z. Kolar-Begovi&#263; and R. Kolar-&#352;uper, <i>Steiner's ellipses of the triangle in
an isotropic plane</i>, Math. Pannon. <b>21</b> (2010), 229-238.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2907860">MathSciNet</a> 
<p>


</ol>
</small>

<hr size=2 noshade>

<a href="http://web.math.pmf.unizg.hr/~duje/radhazumz/"><em>Rad HAZU</em> Home Page</a>

</body>

</html>

