<html>
<head>

<title>Generalized Hardy-type inequality via Lidstone interpolating polynomial and new Green functions</title>

<meta name="description" content="Rad HAZU, Vol.29, 207-220">

</head>

<!-- 
<body bgcolor="#FFDD77">
-->

<h4>Rad HAZU, Matemati&#269;ke znanosti, Vol. 29 (2025), 207-220.</h4>

<h3 align=center>GENERALIZED HARDY-TYPE INEQUALITY VIA LIDSTONE INTERPOLATING POLYNOMIAL AND NEW GREEN FUNCTIONS</h3>
<h3 align=center>Dora Pokaz</h3>

Faculty of Civil Engineering, University of Zagreb, 10 000 Zagreb, Croatia <br>
<em>e-mail:</em> <tt>dora.pokaz@grad.unizg.hr</tt> 


<p>
<hr size=2 noshade>
<p>


<b>Abstract.</b> &nbsp; For a given general setting, involving measure spaces with
positive &sigma;-finite measures, we present new results regarding Hardy-type
inequality. We established a connection between the difference operator
obtained from Hardy-type inequality and the expression that includes Lidstone
interpolating polynomial and four new Green functions. We discuss
about 2<i>n</i> convexity of the function and consider the main result depending
on the parity of the part of exponent and index <i>n</i>. Applying H&ouml;lder inequality
for conjugate exponents <i>p</i> and <i>q</i> we get some consequential results.
Finally, we derived bounds for the identity using Čebyšev functional and
Ostrowski-type bound for the generalized Hardy's inequality.
<p>
<b>2020 Mathematics Subject Classification.</b> &nbsp; 
26D10, 26D15, 39B62.
<p>
<b>Key words and phrases.</b> &nbsp; Convex function, Hardy-type inequality, Lidstone interpolating
polynomial, Green function, Čebyšev functional.  
<p>

<hr size=2 noshade>

<a href="https://hrcak.srce.hr/file/471963"><b>Full text (PDF)</b></a> (free access)
<p>

DOI: <a href="https://doi.org/10.21857/90836c2p8y">https://doi.org/10.21857/90836c2p8y</a>

<hr size=2 noshade>
<p>
<b>References:</b>
<small>
<ol>

<li> R. P. Agarwal and P. J. Y. Wong, Error Inequalities in Polynomial Interpolation and
Their Applications, Kluwer Academic Publishers, Dordrecht, 1993.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=1449390">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.1007/978-94-011-2026-5">CrossRef</a>
<p>

<li> R. P. Agarwal and P. J. Y.Wong, <i>Lidstone polynomials and boundary value problems</i>,
Comput. Math. Appl. <b>17</b> (1989), 1397-1421
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=992124">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.1016/0898-1221(89)90023-0">CrossRef</a>
<p>

<li> A. Agli&#263; Aljinovi&#263;, J. Pe&#269;ari&#263; and A. Vukeli&#263;, <i>On some Ostrowski type inequalities via
Montgomery identity and Taylor's formula. II</i>, Tamkang J. Math. <b>36</b> (2005), 279-301.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2199836">MathSciNet</a> 
<p>

<li> G. Aras-Gazi&#263;, V. &#268;uljak, J. Pe&#269;ari&#263; and A. Vukeli&#263;, <i>Generalization of Jensen's inequality
by Lidstone's polynomial and related results</i>, Math. Inequal. Appl. <b>16</b> (2013),
1243-1267.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=3156494">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.7153/mia-16-96">CrossRef</a>
<p>

<li> P. Cerone and S. S. Dragomir, <i>Some new Ostrowski-type bounds for the &#268;eby&#353;ev functional
and applications</i>, J. Math. Inequal. <b>8</b> (2014), 159-170.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=3222597">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.7153/jmi-08-10">CrossRef</a>
<p>

<li> G. H. Hardy, <i>Notes on some points in the integral calculus LX: An inequality between
integrals</i>, Messenger of Math. <b>54</b> (1925), 150-156.
<p>

<li> S. Iqbal, K. Kruli&#263; Himmelreich, J. Pe&#269;ari&#263; and D. Pokaz, <i>Hardy type inequalities involving
Lidstone interpolation polynomials</i>, submitted.
<p>

<li> S. Kaijser, L. Nikolova, L.-E. Persson and A. Wedestig, <i>Hardy-type inequalities via
convexity</i>, Math. Inequal. Appl. <b>8</b> (2005), 403-417.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2148234">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.7153/mia-08-38">CrossRef</a>
<p>

<li> K. Kruli&#263; Himmelreich, J. Pe&#269;ari&#263; and D. Pokaz, Inequalities of Hardy and Jensen,
Element, Zagreb, 2013.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=3287251">MathSciNet</a> 
<p>

<li> K. Kruli&#263; Himmelreich, J. Pe&#269;ari&#263;, D. Pokaz and M. Praljak, <i>Generalizations of 
Hardy-type inequalities by Montgomery identity and new Green functions</i>, Axioms <b>12</b> (2003),
434.
<br>
<a href="https://doi.org/10.3390/axioms12050434">CrossRef</a>
<p>

<li> K. Kruli&#263; Himmelreich, J. Pe&#269;ari&#263;, D. Pokaz, D. and M. Praljak, <i>Generalizations of
Hardy type inequalities by Abel-Gontscharoff's interpolating polynomial</i>, Mathematics
<b>9</b> (2021), 1724.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=10.3390/math9151724">MathSciNet</a> 
<p>

<li> A. Kufner, L. Maligranda and L.-E. Persson, The Hardy Inequality. About its History
and Some Related Results, Vydavatelsky Servis Publishing House, Pilsen, 2007.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2351524">MathSciNet</a> 
<p>

<li> A. Kufner, L. Maligranda and L.-E. Persson, <i>The prehistory of the Hardy inequality</i>,
Amer. Math. Monthly <b>113</b> (2006), 715-732.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=2256532">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.2307/27642033">CrossRef</a>
<p>

<li> J. E. Pe&#269;ari&#263;, F. Proschan and Y. L. Tong, Convex Functions, Partial Orderings and
Statistical Applications, Mathematics in Science and Engineering 187, Academic Press,
Boston, 1992.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=1162312">MathSciNet</a> 
<p>

<li> J. M. Whittaker, <i>On Lidstone series and two-point expansions of analytic functions</i>,
Proc. Lond. Math. Soc. (2) <b>36</b> (1934), 451-469.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=1575969">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.1112/plms/s2-36.1.451">CrossRef</a>
<p>

<li> D. V. Widder, <i>Completely convex function and Lidstone series</i>, Trans. Amer. Math.
Soc. <b>51</b> (1942), 387-398.
<br>
<a href="https://www.ams.org/mathscinet-getitem?mr=6356">MathSciNet</a> &nbsp; &nbsp; 
<a href="https://doi.org/10.2307/1989952">CrossRef</a>
<p>


</ol>
</small>

<hr size=2 noshade>

<a href="https://web.math.pmf.unizg.hr/~duje/radhazumz/"><em>Rad HAZU</em> Home Page</a>

</body>

</html>

