<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>DES - Na&#269;ini djelovanja</title>

<meta name="author" content="Andrej Dujella">
<meta name="description" content="DES - Nacini djelovanja">
<meta name="keywords" content="kriptografija, DES, 
modes of operation, ECB, Electronic Codebook, CBC, Cipher Block 
Chaining, CFB, Cipher Feedback, OFB, Output Feedback">

<meta http-equiv="Content-Type" content="text/html; charset=windows-1250">

<meta name="viewport" content="width=device-width, initial-scale=0.6">

<style type="text/css">
body {font-family: Arial,Helvetica,sans-serif;}
</style>

</head>

<body bgcolor="#FFFFFF">

<b><font size="-1" face="Verdana">
<a href="desprop.html">[Prethodno poglavlje]</a> &nbsp; 
<a href="desan.html">[Sljede&#263;e poglavlje]</a> &nbsp;
<a href="kriptografija.html">[Sadr&#382;aj]</a>
</font></b>

<hr size=2 noshade>


<a name="2.4"></a>
<h2 align=center style="color: rgb(128,0,0)">2.4. Na&#269;ini djelovanja</h2>


Iako je sam opis DES-a dosta dug, on se mo&#382;e vrlo efikasno 
implementirati, i hardverski i softverski. Spomenimo da je do 1991. 
godine u NBS-u registrirano 45 hardverskih implementacija DES-a. 
Godine 1992. proizveden je &#269;ip s 50000 tranzistora koji mo&#382;e &#353;ifrirati 
10<sup>9</sup> bita (tj. 16 milijuna blokova) po sekundi (&#269;ip je ko&#353;tao 
300 dolara). 
<p>
Jedna va&#382;na primjena DES-a je u bankarskim transakcijama. Tako se, 
izme&#273;u ostalog, DES koristio za &#353;ifriranje PIN-ova (personal 
identification numbers), te transakcija preko bankomata. 
DES je tako&#273;er do nedavno bio u &#353;irokoj uporabi u civilnim 
satelitskim komunikacijama. 
<p><br>
Mi smo do sada opisali kako radi DES na jednom bloku od 64 bita. 
U realnim situacijama, u kojima su poruke znatno du&#382;e, poznata  
su 4 <em>na&#269;ina djelovanja</em> (modes of operation) DES-a. Ti 
<em>modovi</em> pokrivaju sve mogu&#263;e primjene DES-a, a tako&#273;er su 
primjenjivi na bilo koju simetri&#269;nu blokovnu &#353;ifru. 
<p>
Najjednostavniji mod je ECB (Electronic Codebook) u kojem se svaki 
blok otvorenog teksta &#353;ifrira s istim klju&#269;em. Dakle, poruka se 
razbije na blokove od po 64 bita (zadnji blok se nadopuni ako je 
nu&#382;no), te se &#353;ifrira jedan po jedan blok koriste&#263;i uvijek jedan te 
isti klju&#269;. 
<p align=center>
<img src="slike/ecbmode.gif" alt="ecb mode">
</p>

ECB mod je idealan za kratke poruke, pa se &#269;esto koristi za razmjenu 
klju&#269;eva za &#353;ifriranje. Kod dugih poruka sigurnost ECB moda se 
smanjuje, budu&#263;i da identi&#269;ni blokovi u otvorenom tekstu daju 
identi&#269;ne &#353;ifrate. 
<p>
Da bi pove&#263;ali sigurnost, &#382;elimo posti&#263;i da identi&#269;nim blokovima u 
otvorenom tekstu odgovaraju razli&#269;iti &#353;ifrati. Relativno jednostavan 
na&#269;in da se to postigne je kori&#353;tenje CBC (Cipher Block Chaining) moda. 
Na trenutni blok otvorenog teksta se primjeni operacija XOR sa 
&#353;ifratom prethodnog bloka, a tek potom se &#353;ifrira pomo&#263;u klju&#269;a 
<i>K</i>. 
Dakle, <nobr><i>y<sub>i</sub></i> = 
<i>e<sub>K</sub></i>(<i>y</i><sub><i>i</i> -1</sub> 
&oplus;  
<i>x<sub>i</sub></i>)</nobr> za <nobr><i>i</i> &ge; 1.</nobr>   
Na startu uzimamo da je <i>y</i><sub>0</sub> = IV, gdje je IV 
tzv. inicijaliziraju&#263;i vektor, koji mora biti poznat i primaocu i 
po&#353;iljaocu. To se mo&#382;e posti&#263;i npr. tako da ga se po&#353;alje ECB modom. 
Za de&#353;ifriranje koristimo relaciju 
<nobr><i>x<sub>i</sub></i> = 
<i>y</i><sub><i>i</i> -1</sub> 
&oplus;  
<i>d<sub>K</sub></i>(<i>y<sub>i</sub></i>).</nobr>  

<p align=center>
<img src="slike/cbcmode.gif" alt="cbc mode">
</p>

U prethodna dva moda DES funkcionira kao blokovna &#353;ifra. No, od DES-a 
se mo&#382;e napraviti i proto&#269;na (stream) &#353;ifra. Prvi na&#269;in je pomo&#263;u 
CFB (Cipher Feedback) moda. Kod proto&#269;nih &#353;ifri nema potrebe za 
pro&#353;irivanjem poruke da bi se dobio cijeli broj blokova. To zna&#269;i da &#263;e 
&#353;ifrat biti iste duljine kao otvoreni tekst. Obra&#273;uje se odjednom 
<i>j</i> bitova 
(1 &le; <i>j</i> &le; 64). 
Naj&#269;e&#353;&#263;e je <i>j</i> = 1 ili <i>j</i> = 8. Ako je <i>j</i> = 8, 
to zna&#269;i da se &#353;ifrira slovo po slovo (jednom slovu odgovara 8 
bitova po ASCII standardu). 
<p>
U &#353;ifriranje kre&#263;emo &#353;ifriranjem 64 bitnog inicijaliziraju&#263;eg 
vektora IV. Na <i>j</i> najlijevijih bitova 
izlaznog podatka primijenimo 
XOR sa <i>x</i><sub>1</sub> i tako dobijemo <i>y</i><sub>1</sub>. 
Ulazni podatak za sljede&#263;i korak &#353;ifriranja se dobije tako da se 
prethodni ulazni podatak pomakne za <i>j</i> mjesta ulijevo, a 
na desni kraj se stavi <i>y</i><sub>1</sub>. Postupak se nastavlja 
sve dok se sve jedinice otvorenog teksta ne &#353;ifriraju. 
<p align=center>
<img src="slike/cfbmode.gif" alt="cfb mode">
</p>

Kod de&#353;ifriranja se koristi ista shema, osim &#353;to se na 
odgovaraju&#263;i &#353;ifrat primjeni XOR s izlaznim podatkom funkcije &#353;ifriranja 
<i>e<sub>K</sub></i> da bi se dobio otvoreni tekst. Uo&#269;imo da se ponovo 
koristi funkcija <i>e<sub>K</sub></i>, a ne <i>d<sub>K</sub></i>. 
Naime, ovdje je funkcija 
&#353;ifriranja zapravo XOR, a on je sam sebi inverz.
Zapravo, ovaj modus mo&#382;emo shvatiti kao svojevrsnu realizaciju 
&quot;jednokratne bilje&#382;nice&quot;, 
u kojoj nam <i>e<sub>K</sub></i> ne slu&#382;i za &#353;ifriranje, ve&#263; za generiranje 
&quot;pseudoslu&#269;ajnog&quot; 
klju&#269;a za jednokratnu bilje&#382;nicu. Ovo pokazuje da inicijalni vektor IV mora biti 
&quot;svje&#382;&quot;, 
tj. ne bi se dvaput smio koristiti isti inicijalni vektor.
<p>

OFB (Output Feedback) mod je vrlo sli&#269;an kao CFB. Jedina razlika 
je da se ulazni podatak za funkciju <i>e<sub>K</sub></i> 
u idu&#263;em koraku &#353;alje odmah nakon primjene <i>e<sub>K</sub></i> 
u prethodnom koraku (prije primjene XOR-a). Jedna od prednosti 
OFB moda je da se gre&#353;ke u transmisiji ne propagiraju. Npr. 
gre&#353;ka u <i>y</i><sub>1</sub> utje&#269;e samo na <i>x</i><sub>1</sub>. 
Ovaj mod se &#269;esto koristi u &#353;ifriranje poruka sa satelita. 
No, ovo svojstvo mo&#382;e biti i nedostatak. Stoga se modovi CBC i CFB 
koriste za ustanovljavanje vjerodostojnosti poruke. 
   
<p align=center>
<img src="slike/ofbmode.gif" alt="ofb mode">
</p> 
<p>

Pored ova &#269;etiri (klasi&#269;na) na&#269;ina djelovanja, u posljednje je vrijeme sve
popularniji CTR (Counter) mod. U njemu se koristi niz broja&#269;a (countera)
<nobr><i>c</i><sub>1</sub>, <i>c</i><sub>2</sub>, ... .</nobr> 
Niz blokova &#353;ifrata dobiva se po sljede&#263;em pravilu:
<p align=center>
 <i>y<sub>i</sub></i> = <i>x<sub>i</sub></i> 
&oplus; <i>e<sub>K</sub></i>(<i>c<sub>i</sub></i>). 
</p>
Broja&#269;i moraju biti u parovima razli&#269;iti. Obi&#269;no se to posti&#382;e tako da se broja&#269;u 
<i>c</i><sub>1</sub>
pridru&#382;i neka inicijalna vrijednost, a potom se ostali broja&#269;i pove&#263;avaju za 1: 
<nobr><i>c<sub>i</sub></i> = <i>c</i><sub>1</sub> + (<i>i</i> - 1)</nobr> 
(zbrajanje je modulo 2<sup><i>b</i></sup>, gdje je <i>b</i> duljina bloka; 
kod DES-a je <i>b</i> = 64).
<p>

Za razliku od prethodna tri &quot;ulan&#269;ana&quot; (chaining) moda, 
u CTR modu se &#353;ifriranje (i de&#353;ifriranje)
mo&#382;e lako paralelizirati. Kod ulan&#269;anih modusa je to bio problem, jer je
algoritam morao zavr&#353;iti obradu jednog bloka, da bi pre&#353;ao na naredni. To pokazuje
jo&#353; jednu prednost CTR modusa, a to je mogu&#263;nost de&#353;ifriranja samo jednog odre&#273;enog bloka,
&#353;to mo&#382;e biti interesanstno za neke aplikacije. Sli&#269;no kao kod CFB i OFB modusa,
i ovdje se u de&#353;ifiranju ponovo koristi funkcija <i>e<sub>K</sub></i> 
(a ne <i>d<sub>K</sub></i>). Ovo nije neka
posebna prednost kod DES-a, ali mo&#382;e biti relevantno kod blokovnih kriptosustava
kod kojih algoritam de&#353;ifriranja nije doslovno isti kao algoritam &#353;ifriranja
(npr. AES).

<p align=center>
<img src="slike/ctrmode.gif" alt="ctr mode">
</p> 
<p>

<hr size=2 noshade>

<b><font size="-1" face="Verdana">
<a href="desprop.html">[Prethodno poglavlje]</a> &nbsp; 
<a href="desan.html">[Sljede&#263;e poglavlje]</a> &nbsp;
<a href="kriptografija.html">[Sadr&#382;aj]</a>
</font></b>

<hr size=2 noshade>


<table border="0" width="100%">
<tr valign="bottom">
<td>
<a href="../kript.html">Web stranica kolegija <em>Kriptografija</em></a>
</td>

<td align="right">
<a href="../index.html"><em>Andrej Dujella</em> - osobna stranica</a>
</td>
</tr>
</table>

<!-- Start eXTReMe Non Public Tracker Code V3/5
Login:    duje
Help:     https://www.extremetracking.com -->
<script type="text/javascript"><!--
EXs=screen;EXw=EXs.width;navigator.appName!="Netscape"?
EXb=EXs.colorDepth:EXb=EXs.pixelDepth;
navigator.javaEnabled()==1?EXjv="y":EXjv="n";
EXd=document;EXw?"":EXw="na";EXb?"":EXb="na";
location.protocol=="https:"?EXprot="https":EXprot="http";
top.document.referrer?EXref=top.document.referrer:EXref=EXd.referrer;
EXd.write("<img src="+EXprot+"://nht-2.extreme-dm.com",
"/n2.g?login=duje&amp;url="+escape(document.URL)+"&amp;pv=&amp;",
"jv="+EXjv+"&amp;j=y&amp;srw="+EXw+"&amp;srb="+EXb+"&amp;",
"l="+escape(EXref)+" height=1 width=1>");//-->
</script><noscript><div id="nneXTReMe"><img height="1" width="1" alt=""
src="http://nht-2.extreme-dm.com/n2.g?login=duje&amp;url=nojs&amp;j=n&amp;jv=n&amp;pv=" />
</div></noscript>
<!-- End eXTReMe Non Public Tracker Code -->

</body>
</html>







