<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Klasi&#269;na kriptografija - Osnovni pojmovi</title>

<meta name="author" content="Andrej Dujella">
<meta name="description" content="Kriptografija - Osnovni pojmovi">
<meta name="keywords" content="kriptografija, kriptoanaliza, 
kriptologija">

<meta http-equiv="Content-Type" content="text/html; charset=windows-1250">

<meta name="viewport" content="width=device-width, initial-scale=0.6">

<style type="text/css">
body {font-family: Arial,Helvetica,sans-serif;}
</style>

</head>

<body bgcolor="#FFFFFF">

<b><font size="-1" face="Verdana">
<a href="supst.html">[Sljede&#263;e poglavlje]</a> &nbsp;
<a href="kriptografija.html">[Sadr&#382;aj]</a>
</font></b>

<hr size=2 noshade>



<h1 align=center style="color: rgb(204,0,0)">1. Klasi&#269;na kriptografija</h1>

<a name="1.1"></a>
<h2 align=center style="color: rgb(128,0,0)">1.1. Osnovni pojmovi</h2>


<em>Kriptografija</em> je znanstvena disciplina koja se bavi 
prou&#269;avanjem metoda za slanje poruka u takvom obliku da ih samo 
onaj kome su namijenjene mo&#382;e pro&#269;itati. Sama rije&#269; 
kriptografija je gr&#269;kog podrijetla i mogla bi se doslovno prevesti kao <em>tajnopis</em>. 
<p>

<img src="slike/skital12.gif" width=416 height=150 alt="skital" align=right>
Neki elementi kriptografije bili su prisutni ve&#263; kod starih Grka. 
Naime, 
Spartanci su u 5. stolje&#263;u prije Krista upotrebljavali napravu za 
&#353;ifriranje zvanu <em>skital</em>. To je bio drveni &#353;tap oko kojeg se 
namotavala vrpca od pergamenta, pa se na nju okomito pisala poruka. 
Nakon upisivanja poruke, vrpca bi se odmotala, a na njoj bi ostali 
izmije&#353;ani znakovi koje je mogao pro&#269;itati samo onaj tko je 
imao &#353;tap jednake debljine. 
<p>
Osnovni zadatak kriptografije je omogu&#263;iti dvjema osobama 
(zvat &#263;emo ih <em>po&#353;iljalac</em> i <em>primalac</em> - u kriptografskoj 
literaturi su za njih rezervirana imena Alice i Bob) komuniciranje  
preko nesigurnog komunikacijskog kanala (telefonska linija, 
ra&#269;unalna mre&#382;a, ...) na na&#269;in da tre&#263;a osoba 
(njihov protivnik - u literaturi se naj&#269;e&#353;&#263;e zove Eva ili Oskar), 
koja mo&#382;e nadzirati komunikacijski kanal,  
ne mo&#382;e razumjeti njihove poruke. 
Poruku koju po&#353;iljalac &#382;eli poslati primaocu zvat &#263;emo 
<em>otvoreni tekst</em> (engl. plaintext). To mo&#382;e biti 
tekst na njihovom materinjem jeziku, numeri&#269;ki podatci ili 
bilo &#353;to drugo. Po&#353;iljalac transformira otvoreni tekst 
koriste&#263;i unaprijed dogovoreni <em>klju&#269;</em>. Taj postupak se 
naziva <em>&#353;ifriranje</em>, a dobiveni rezultat <em>&#353;ifrat</em> 
(engl. ciphertext) ili <em>kriptogram</em>. Nakon toga po&#353;iljalac 
po&#353;alje &#353;ifrat preko nekog komunikacijskog kanala. 
Protivnik prislu&#353;kuju&#263;i mo&#382;e doznati sadr&#382;aj &#353;ifrata, ali 
ne mo&#382;e odrediti otvoreni tekst. Za razliku od njega, primalac 
koji zna klju&#269; kojim je &#353;ifrirana poruka mo&#382;e 
<em>de&#353;ifrirati</em> &#353;ifrat i odrediti otvoreni tekst. 
<p align=center>
<img src="slike/kript_pravokutnici1.gif" alt="shema">
</p>
Za razliku od de&#353;ifriranja, <em>kriptoanaliza</em> ili 
<em>dekriptiranje</em> je znanstvena disciplina koja se bavi 
prou&#269;avanjem postupaka za &#269;itanje skrivenih poruka bez 
poznavanja klju&#269;a. <em>Kriptologija</em> je pak grana 
znanosti koja obuhva&#263;a kriptografiju i kriptoanalizu. 
<p>
<em>Kriptografski algoritam</em> ili <em>&#353;ifra</em> je 
matemati&#269;ka funkcija koja se koristi za &#353;ifriranje i 
de&#353;ifriranje. Op&#263;enito, radi se o dvije funkcije, jednoj 
za &#353;ifriranje, a drugoj za de&#353;ifriranje. 
Te funkcije preslikavaju osnovne elemente otvorenog teksta 
(naj&#269;e&#353;&#263;e su to slova, bitovi, grupe slova ili bitova) 
u osnovne elemente &#353;ifrata, i obratno. 
Funkcije se biraju iz odre&#273;ene familije funkcija u ovisnosti 
o klju&#269;u. Skup svih mogu&#263;ih vrijednosti klju&#269;eva 
nazivamo <em>prostor klju&#269;eva</em>. <em>Kriptosustav</em> se sastoji 
od kriptografskog 
algoritma, te svih mogu&#263;ih otvorenih tekstova, &#353;ifrata i 
klju&#269;eva. Dakle, imamo sljede&#263;u formalnu definiciju. 
<p>

<table align=center border=1 width="95%" cellpadding=15> 
<tr>
<td bgcolor="FFFFCC">
<font face="Arial,Helvetica,sans-serif">

<b>Definicija 1.1: </b> <em>Kriptosustav</em> je ure&#273;ena petorka 
(<font face="Brush Script MT,Script,Times New Roman">P</font>, 
<font face="Brush Script MT,Script,Times New Roman">C</font>, 
<font face="Brush Script MT,Script,Times New Roman">K</font>, 
<font face="Brush Script MT,Script,Times New Roman">E</font>, 
<font face="Brush Script MT,Script,Times New Roman">D</font>) za koju 
vrijedi: <br>
&nbsp; &nbsp; &nbsp; 1) <font face="Brush Script MT,Script,Times New Roman">P</font> 
je kona&#269;an skup svih mogu&#263;ih osnovnih elementa otvorenog teksta; <br>
&nbsp; &nbsp; &nbsp; 2) <font face="Brush Script MT,Script,Times New Roman">C</font> 
je kona&#269;an skup svih mogu&#263;ih osnovnih elemenata &#353;ifrata; <br>
&nbsp; &nbsp; &nbsp; 3) <font face="Brush Script MT,Script,Times New Roman">K</font> 
je prostor klju&#269;eva, tj. kona&#269;an skup svih 
mogu&#263;ih klju&#269;eva; <br> 
&nbsp; &nbsp; &nbsp; 4) Za svaki <nobr><i>K</i> 
&isin;  
<font face="Brush Script MT,Script,Times New Roman">K</font></nobr> 
postoji funkcija &#353;ifriranja 
<nobr><i>e<sub>K</sub></i> 
&isin;  
<font face="Brush Script MT,Script,Times New Roman">E</font></nobr> i 
odgovaraju&#263;a funkcija de&#353;ifriranja 
<nobr><i>d<sub>K</sub></i> &isin;  
<font face="Brush Script MT,Script,Times New Roman">D</font>.</nobr> Pritom su 
<nobr><i>e<sub>K</sub></i> : <font face="Brush Script MT,Script,Times New Roman">P</font> 
&rarr;  
<font face="Brush Script MT,Script,Times New Roman">C</font></nobr> i 
<nobr><i>d<sub>K</sub></i> : <font face="Brush Script MT,Script,Times New Roman">C</font> 
&rarr; 
<font face="Brush Script MT,Script,Times New Roman">P</font></nobr>
funkcije sa svojstvom da je 
<nobr><i>d<sub>K</sub></i>(<i>e<sub>K</sub></i>(<i>x</i>)) = <i>x</i></nobr>  
za svaki otvoreni tekst <nobr><i>x</i> 
&isin;  
<font face="Brush Script MT,Script,Times New Roman">P</font>.</nobr>  
</font></td></tr></table>

<p>
Najva&#382;nije svojstvo u definiciji je <nobr><i>d<sub>K</sub></i>(<i>e<sub>K</sub></i>(<i>x</i>)) = <i>x</i></nobr>. 
Iz njega slijedi da funkcije 
<i>e<sub>K</sub></i> moraju biti injekcije. Zaista, ako bi bilo 
<p align=center>
<i>e<sub>K</sub></i>(<i>x</i><sub>1</sub>) = 
<i>e<sub>K</sub></i>(<i>x</i><sub>2</sub>) = <i>y</i>, 
</p>
za dva razli&#269;ita otvorena teksta <i>x</i><sub>1</sub> i <i>x</i><sub>2</sub>, 
onda primalac ne bi mogao odrediti treba li <i>y</i> de&#353;ifrirati u 
<i>x</i><sub>1</sub> ili <i>x</i><sub>2</sub>, tj. 
<i>d<sub>K</sub></i>(<i>y</i>) ne bi bilo definirano. 
U skladu s tim imamo da ako je 
<nobr><font face="Brush Script MT,Script,Times New Roman">P</font> = 
<font face="Brush Script MT,Script,Times New Roman">C</font>,</nobr>   
onda su funkcije <i>e<sub>K</sub></i> permutacije. 

<br><p>

Kriptosustave obi&#269;no klasificiramo s obzirom na sljede&#263;a tri 
kriterija: 

<p>

<b>1. Tip operacija koje se koriste pri &#353;ifriranju</b><p>

Imamo podjelu na <em>supstitucijske &#353;ifre</em> u kojima se svaki 
<em>element otvorenog teksta</em> (bit, slovo, grupa bitova ili slova) 
zamjenjuje s nekim drugim elementom, te <em>transpozicijske &#353;ifre</em> 
u kojima se elementi otvorenog teksta permutiraju (premje&#353;taju). Npr. ako rije&#269; 
TAJNA &#353;ifriramo u XIWOI, na&#269;inili smo supstituciju, a ako je 
&#353;ifriramo u JANAT, na&#269;inili smo transpoziciju. Postoje 
tako&#273;er i kriptosustavi koji kombiniraju ove dvije metode. 

<p>

<b>2. Na&#269;in na koji se obra&#273;uje otvoreni tekst</b><p>

Ovdje razlikujemo <em>blokovne &#353;ifre</em>, kod kojih se obra&#273;uje 
jedan po jedan blok elemenata otvorenog teksta koriste&#263;i jedan te 
isti klju&#269; <i>K</i>, te <em>proto&#269;ne &#353;ifre</em> (engl. stream 
cipher) kod koji se elementi otvorenog teksta obra&#273;uju jedan po jedan 
koriste&#263;i pritom niz klju&#269;eva (engl. keystream) koji se 
paralelno generira. 

<p>

<b>3. Tajnost i javnost klju&#269;eva</b><p>

Ovdje je osnovna podjela na <em>simetri&#269;ne kriptosustave</em> 
i <em>kriptosustave s javnim klju&#269;em</em>. Kod simetri&#269;nih 
ili konvencionalnih kriptosustava, klju&#269; za de&#353;ifriranje 
se mo&#382;e izra&#269;unati poznavaju&#263;i klju&#269; za &#353;ifriranje i 
obratno. Ustvari, naj&#269;e&#353;&#263;e su ovi klju&#269;evi 
identi&#269;ni. Sigurnost ovih kriptosustava le&#382;i u tajnosti 
klju&#269;a. Zato se oni zovu i <em>kriptosustavi s tajnim 
klju&#269;em</em>. 

Kod kriptosustava s javnim klju&#269;em ili asimetri&#269;nih kriptosustava, 
klju&#269; za de&#353;ifriranje se ne mo&#382;e 
(barem ne u nekom razumnom vremenu) izra&#269;unati iz klju&#269;a 
za &#353;ifriranje. Ovdje je klju&#269; za &#353;ifriranje <em>javni klju&#269;</em>. 
Naime, bilo tko mo&#382;e &#353;ifrirati poruku 
pomo&#263;u njega, ali samo osoba koja ima odgovaraju klju&#269; za 
de&#353;ifriranje (<em>privatni</em> ili <em>tajni klju&#269;</em>) 
mo&#382;e de&#353;ifrirati tu poruku. Ideju javnog klju&#269;a prvi su javno iznijeli 
<font color=009900>Whitfield Diffie</font> i 
<font color=009900>Martin Hellman</font> 1976. godine, kada su dali prijedlog 
rje&#353;enja problema razmjenjivanja klju&#269;eva za simetri&#269;ne kriptosustave putem nesigurnih 
komunikacijskih kanala. 

<br><p> 

Sada &#263;emo dati nekoliko op&#263;ih napomena o kriptoanalizi. 

Osnovna pretpostavka kriptoanalize je da kriptoanaliti&#269;ar zna koji 
se kriptosustav koristi. To se zove <em>Kerckhoffsovo na&#269;elo</em>,  
po Nizozemcu <font color=009900>Augustu Kerckhoffsu</font> 
(1835-1903), autoru va&#382;ne knjige "La Cryptographie militaire" 
(Vojna kriptografija). 
Naravno, ova pretpostavka u konkretnom slu&#269;aju ne mora biti to&#269;na, 
ali mi ne &#382;elimo da nam sigurnost kriptosustava 
le&#382;i na "klimavoj" pretpostavci da na&#353; protivnik ne zna koji 
kriptosustav koristimo. &#268;ak ukoliko kriptoanaliti&#269;ar treba 
provjeriti nekoliko mogu&#263;ih kriptosustava, time se kompleksnost 
procedure bitno ne mijenja. 
Dakle, mi pretpostavljamo da tajnost &#353;ifre u potpunosti le&#382;i u klju&#269;u. 
<p>

Razlikujemo &#269;etiri osnovna nivoa kriptoanaliti&#269;kih napada. 

<p>

<b>1. Samo &#353;ifrat</b><p> 

Kriptoanaliti&#269;ar posjeduje samo &#353;ifrat od nekoliko poruka 
&#353;ifriranih pomo&#263;u istog algoritma. Njegov je zadatak otkriti 
otvoreni tekst od &#353;to vi&#353;e poruka ili u najboljem 
slu&#269;aju otkriti klju&#269; kojim su poruke &#353;ifrirane. 

<p>

<b>2. Poznat otvoreni tekst</b><p>

Kriptoanaliti&#269;ar posjeduje &#353;ifrat neke poruke, ali i njemu 
odgovaraju&#263;i otvoreni tekst. Njegov zadatak je otkriti klju&#269; 
ili neki algoritam za de&#353;ifriranje poruka &#353;ifriranih s tim klju&#269;em. 

<p>

<b>3. Odabrani otvoreni tekst</b><p>

Kriptoanaliti&#269;ar ima mogu&#263;nost odabira teksta koji &#263;e biti 
&#353;ifriran, te mo&#382;e dobiti njegov &#353;ifrat. Ovaj napad je 
ja&#269;i od prethodnoga, ali je manje realisti&#269;an. 

<p>

<b>4. Odabrani &#353;ifrat</b><p>

Kriptoanaliti&#269;ar je dobio pristup alatu za de&#353;ifriranje, 
pa mo&#382;e odabrati &#353;ifrat, te dobiti odgovaraju&#263;i otvoreni 
tekst. Ovaj napad je tipi&#269;an kod kriptosustava s javnim 
klju&#269;em. Tu je zadatak kriptoanaliti&#269;ara otkriti klju&#269; 
za de&#353;ifriranje (tajni klju&#269;).  

<p>

<b>(5.) Potkupljivanje, ucjena, kra&#273;a i sli&#269;no</b><p> 

Ovaj napad ne spada doslovno u kriptoanalizu, ali je vrlo efikasan i 
&#269;esto primjenjivan u kombinaciji s "pravim" kriptoanaliti&#269;kim napadima. 
<p>

Naravno, mo&#382;emo se pitati koliko je realno da &#263;e kriptoanaliti&#269;ar biti u prilici 
primijeniti 2., 3. ili 4. vrstu napada. Na prvi pogled to izgleda dosta 
nerealno. Me&#273;utim, tu treba imati u vidu &#269;injenicu da je kriptoanaliti&#269;ar 
ve&#263; nekako do&#353;ao u posjed &#353;ifrata koji nije bio njemu namjenjen. 
Dakle, svakako on posjeduje izvjesne sposobnosti koje mu mogu pomo&#263;i 
i oko drugih vrsta kriptoanaliti&#269;kih napada. 

<hr size=2 noshade> 

<b><font size="-1" face="Verdana">
<a href="supst.html">[Sljede&#263;e poglavlje]</a> &nbsp;
<a href="kriptografija.html">[Sadr&#382;aj]</a>
</font></b>

<hr size=2 noshade> 


<table border="0" width="100%">
<tr valign="bottom">
<td>
<a href="../kript.html">Web stranica kolegija <em>Kriptografija</em></a>
</td>

<td align="right">
<a href="../index.html"><em>Andrej Dujella</em> - osobna stranica</a>
</td>
</tr>
</table>

<!-- Start eXTReMe Non Public Tracker Code
Login:    duje
Page ID:  osnovni
Page URL: http://www.math.hr/~duje/kript/osnovni.html
Help:     http://www.extremetracking.com/  -->
<script type="text/javascript" language="javascript1.2"><!--
EXs=screen;EXw=EXs.width;navigator.appName!="Netscape"?
EXb=EXs.colorDepth:EXb=EXs.pixelDepth;//-->
</script><script type="text/javascript"><!--
navigator.javaEnabled()==1?EXjv="y":EXjv="n";
EXd=document;EXw?"":EXw="na";EXb?"":EXb="na";
EXd.write("<img src=http://nht-2.extreme-dm.com",
"/n2.g?login=duje&amp;pid=osnovni&amp;",
"jv="+EXjv+"&amp;j=y&amp;srw="+EXw+"&amp;srb="+EXb+"&amp;",
"l="+escape(EXd.referrer)+" height=1 width=1>");//-->
</script><noscript><img height="1" width="1" alt=""
src="http://nht-2.extreme-dm.com/n2.g?login=duje&amp;pid=osnovni&amp;j=n&amp;jv=n"/>
</noscript>
<!-- End eXTReMe Non Public Tracker Code -->



</body>
</html>
