<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Playfairova &#353;ifra</title>

<meta name="author" content="Andrej Dujella">
<meta name="description" content="Kriptografija - Playfairova sifra">
<meta name="keywords" content="kriptografija, Plaifairova sifra">

<meta http-equiv="Content-Type" content="text/html; charset=windows-1250">

<meta name="viewport" content="width=device-width, initial-scale=0.6">

<style type="text/css">
body {font-family: Arial,Helvetica,sans-serif;}
</style>

</head>

<body bgcolor="#FFFFFF">

<b><font size="-1" face="Verdana">
<a href="vigener.html">[Prethodno poglavlje]</a> &nbsp; 
<a href="hill.html">[Sljede&#263;e poglavlje]</a> &nbsp; 
<a href="kriptografija.html">[Sadr&#382;aj]</a>
</font></b>

<hr size=2 noshade>


<a name="1.4"></a>
<h2 align=center style="color: rgb(128,0,0)">1.4. Playfairova &#353;ifra</h2>


Jedna ideja za pobolj&#353;anje supstitucijskih &#353;ifara je uvo&#273;enje 
polialfabetskih &#353;ifara. Jednu takvu &#353;ifru smo vidjeli u prethodnom 
poglavlju. Druga ideja je uporaba blokova slova kao osnovnih 
elemenata otvorenog teksta. 
No, veliki je problem kako spretno realizirati tu ideju, jer ve&#263; za blokove od dva slova 
treba opisati (zapamtiti, sigurno prenijeti) &#353;ifrate od 26<sup>2</sup> = 676 
elemenata otvorenog teksta. 
Prikazat &#263;emo najpoznatiju takvu &#353;ifru, 
tzv. <em>Playfairovu &#353;ifru</em>. Ovu &#353;ifru je izumio britanski znanstvenik 
<font color=009900>Charles Wheatstone</font> 1854. godine, a ime je 
dobila po njegovom prijatelju barunu 
<font color=009900>Playfairu od St. Andrewsa</font> koji ju je 
popularizirao. 
<p>
To je bigramska &#353;ifra, u smislu da se &#353;ifriraju parovi slova 
i to tako da rezultat ovisi i o jednom i o drugom slovu. 
Algoritam za &#353;ifriranje se bazira na 
5 &times; 5 matrici slova, 
koja se konstruira koriste&#263;i klju&#269;nu rije&#269;. Na primjer, 
ako je klju&#269;na rije&#269; &nbsp; 
<font color=990099>PLAYFAIR</font>, onda matrica izgleda ovako: 
<pre><font size="+1" color=990099>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; P   L   A   Y   F  

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; IJ  R   B   C   D  

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; E   G   H   K   M  

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; N   O   Q   S   T  

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; U   V   W   X   Z  
</font></pre> 
Budu&#263;i da imamo 25 slova, dogovor je da se slova I i J poistovjete. 
U slu&#269;aju da je otvoreni tekst na hrvatskom jeziku, mi &#263;emo 
poistovje&#263;ivati V i W da bismo izbjegli mogu&#263;e nesporazume kod de&#353;ifriranja. 
<p>
&#352;ifriranje se sada vr&#353;i na sljede&#263;i na&#269;in. Najprije podijelimo otvoreni 
tekst na blokove od po dva slova. Pritom pazimo da se niti jedan blok 
ne sastoji od dva jednaka slova, te da je duljina teksta parna. 
I jedno i drugo posti&#382;emo umetanjem npr. slova X 
ukoliko je to potrebno. 
<p>
Kod &#353;ifriranja bloka od dva slova, mogu nastupiti tri slu&#269;aja, 
ovisno o polo&#382;aju slova u matrici:
<ol>
<li> Slova se nalaze u istom retku. Tada ih zamijenimo sa slovima 
koja se nalaze za jedno mjesto udesno (cikli&#269;ki, tj. 
iza najdesnijeg slova dolazi najljevije slovo iz istog retka). Npr. 
EH &#8614; GK, 
ST &#8614; TN, 
FP &#8614; PL. 
<li> Slova se nalaze u istom stupcu. Tada ih zamijenimo sa slovima koja 
se nalaze za jedno mjesto ispod (cikli&#269;ki, tj. iza najdonjeg slova dolazi najgornje slovo
iz istog stupca). Npr. 
OV &#8614; VL, 
KY &#8614; SC, 
PI &#8614; IE. 
<li> U protivnom, pogledamo pravokutnik koji odre&#273;uju ta dva slova, 
te ih zamijenimo s preostala dva vrha tog pravokutnika. 
Redoslijed je odre&#273;en tako da najprije do&#273;e ono slovo koje 
se nalazi u istom retku kao prvo slovo u polaznom bloku. Npr. 
OC &#8614; SR, 
RK &#8614; CG, 
PD &#8614; FI. 
</ol>
<p>

<b>Primjer 1.8: </b> <em>&#352;ifrirajmo otvoreni tekst</em> &nbsp; 
<font color=990000>CRYPTOGRAPHY</font> 
<em>pomo&#263;u Playfairove &#353;ifre s klju&#269;em</em> &nbsp; 
<font color=990099>PLAYFAIR</font>.

<p> 
<i>Rje&#353;enje</i>. &nbsp; <font color=990000>CR YP TO GR AP HY</font> &nbsp;  
&#8614; &nbsp;  
<font color=000099>DB FL NQ OG YL KA</font> </p>
<p>
Playfairova &#353;ifra ima nekoliko zna&#269;ajnih prednosti pred supstitucijskom &#353;ifrom. 
Budu&#263;i da je &#353;ifra bigramska, gube se u &#353;ifratu 
jednoslovne rije&#269;i (npr. "a") koje dosta utje&#269;u na frekvencije. 
Nadalje, bigramsko &#353;ifriranje smanjuje na polovicu broj elemenata  
dostupnih analizi frekvencije. S druge strane, broj bigrama je puno ve&#263;i 
od broja individualnih slova (26 slova - 676 bigrama), dok su 
frekvencije najfrekventnijih bigrama puno ujedna&#269;enije od 
frekvencija najfrekventnijih slova. 
<p>
Iz ovih razloga, Playfairova &#353;ifra je dugo vremena smatrana sigurnom. 
Tako je bila standardna &#353;ifra u britanskoj vojsci za vrijeme 
1. svjetskog rata, a &#269;ak je kori&#353;tena (za &#353;ifriranje poruka manje va&#382;nosti) 
i u ameri&#269;koj vojsci u 2. svjetskom ratu. 
<p>
Ipak, kod dugih tekstova ova &#353;ifra postaje nesigurna jer se mo&#382;e 
iskoristiti analiza frekvencija bigrama. 
Poznato je da i kod ove &#353;ifre dio strukture 
jezika ostaje sa&#269;uvan. Naime, slova u &#353;ifratu nisu jednoliko 
raspore&#273;ena. Dok u otvorenom tekstu na engleskom jeziku 
najfrekventnije slovo ima relativnu frekvenciju 
&approx; 13%, 
u &#353;ifratu dobivenom Playfairovom &#353;ifrom to iznosi 
&approx; 7%, 
dok recimo kod Vigenereove &#353;ifre imamo 
&approx; 6%. 
Takvi podatci mogu nam pomo&#263;i i kod odre&#273;ivanja vrste &#353;ifre. 
<p>

<b>Primjer 1.9: </b> <em>Dekriptirati &#353;ifrat</em>
<pre><font size="+1" color=000099>       CK FL ET IJ KS VI XG IE QO SA
       GA PL TE AU KH CA ET AF CK TO
       IV OV OI AD BS HM HA OJ AF VU
       OL HN TY LS AB PJ OL PJ AI LO
       AJ HT CS VI OJ VC UI VI XG IE
       ZC AI BS HM IE AJ SJ NT SJ AF
       OJ VC ZA PJ JT HT ET OJ FJ   
</font></pre>
<em>dobiven Playfairovom &#353;ifrom (V = W). Otvoreni tekst je na 
hrvatskom jeziku.</em>
<p>
<i>Rje&#353;enje</i>. Ovaj &#353;ifrat je prekratak da bi ga dekriptirali samo analizom 
frekvencija bigrama. Zato &#263;emo uvesti dodatnu pretpostavku da nam 
je poznata jedna rije&#269; koja se pojavljuje u otvorenom tekstu. 
Dakle, koristit &#263;emo metodu "<em>vjerojatne rije&#269;i</em>". 
Metoda se sastoji 
u tome da se napravi lista rije&#269;i ili fraza 
za koje pretpostavljamo da ih 
otvoreni tekst sadr&#382;i, te da u &#353;ifratu prona&#273;emo segment &#269;ija se
struktura podudara sa strukturom vjerojatne rije&#269;i. 
Recimo da je vjerojatna rije&#269; (fraza) "MATEMATIKA I MATEMATI&#268;ARI". Kod 
rastavljanja na blokove po dva slova, imamo dvije mogu&#263;nosti 
(u ovisnosti o tome gdje se ovaj tekst nalazi unutar poruke): 
<font size="+1">
<pre>
       <u><span style="background-color: #FFFF00">MA</span></u>  TE  <u><span style="background-color: #FFFF00">MA</span></u>  TI  KA  IM  <u><span style="background-color: #00FF00">AT</span></u>  EM  <u><span style="background-color: #00FF00">AT</span></u>  I&#268;  AR  I* 

       *M  <u><span style="background-color: #00FFFF">AT</span></u>  EM  <u><span style="background-color: #00FFFF">AT</span></u>  IK  AI  <u><span style="background-color: #FF99CC">MA</span></u>  TE  <u><span style="background-color: #FF99CC">MA</span></u>  TI  &#268;A  RI
</pre>
</font>
Sada bismo u &#353;ifratu potra&#382;ili segment koji ima neku od ove dvije 
strukture (po dva ponavljanja s istim ovakvim razmacima). 
Ovakav napad je &#269;esto vrlo efikasan. U praksi se on sprje&#269;ava  
tako da se vjerojatne rije&#269;i najprije "<em>kodiraju</em>" 
(npr. MATEMATIKA = ABC, MATEMATI&#268;ARI = ADE), a tek potom 
&#353;ifriraju. Budu&#263;i da nam je poznat &#353;ifrat, to zna&#269;i da smo ve&#263; 
poduzeli (uspje&#353;nu) akciju presretanja poruke, pa nije nerealno 
pretpostaviti da naslu&#263;ujemo barem ne&#353;to o njenom mogu&#263;em sadr&#382;aju. 
Tako&#273;er, &#269;esto su poznate neke informacije o strukturi poruke 
(zaglavlje, datum, kome je naslovljena, od koga potpisana, i sl.).  
<p>
No, za potrebe na&#353;eg primjera, mi &#263;emo pretpostaviti da otvoreni 
tekst sadr&#382;i rije&#269; MINISTARSTVO (u nekom pade&#382;u). Pogledajmo 
strukturu ove rije&#269;i: 
<font size="+1">
<pre>
       MI   NI   <u><span style="background-color: #FFFF00">ST</span></u>   AR   <u><span style="background-color: #FFFF00">ST</span></u>   VO
</pre>
</font>
Identi&#269;nu strukturu uo&#269;avamo u 4. retku &#353;ifrata i kre&#263;emo s 
pretpostavkom da je LS AB PJ OL PJ &#353;ifrat of MI NI ST AR ST. 
To je u skladu s analizom frekvencija bigrama: 
<p align=center>
OJ (4), PJ, AF, IE, ET, VI (3), 
</p>
jer visoko frekventni bigram u hrvatskom jeziku ST, odgovara 
visoko frekventnom bigramu PJ u &#353;ifratu. Dakle, imamo: 
<p align=center>
LS &#8614; MI, 
AB &#8614; NI, 
PJ &#8614; ST, 
OL &#8614; AR. 
</p>
Poku&#353;ajmo krenuti u popunjavanje kvadrata za &#353;ifriranje. 
Krenimo s prvom, tre&#263;om i &#269;etvrtom supstitucijom. 
Uz pretpostavku da se slova u tim supstitucijama ne nalaze u istom 
retku ili stupcu, dobivamo (do na permutaciju redaka ili stupaca, 
ili njihovo spajanje) konfiguraciju
<pre><font size="+1" color=990099>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;    A       O  

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;    L   M   R  
       
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;T       J

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;P   I   S         
</font></pre> 
Za o&#269;ekivati je da OJ odgovara nekom visoko frekventnom bigramu 
(osim ST i RA), a to su JE, NA i AN. Ako 
JE &#8614; OJ, onda su 
E, J, O susjedna slova u istom retku ili istom stupcu, pa taj 
slu&#269;aj mo&#382;emo barem privremeno odbaciti. 
To zna&#269;i da O, J, N, A ili &#269;ine pravokutnik ili se nalaze u istom retku ili stupcu. 
Jedina je mogu&#263;nost da retke s A i O, te T i J spojimo, 
pa tom retku jo&#353; pridodamo N. Taj redak izgleda 
<p align=center>
_ A J _ N O _  &nbsp; &nbsp; &nbsp; ili &nbsp; &nbsp; &nbsp;  _ N J _ A O _ 
</p>
s tim da jo&#353; treba na neko prazno mjesto ubaciti slovo T. 
No, ovih 5 slova je toliko "porazbacano" u abecedi da je jasno 
da je ovaj redak dio klju&#269;a. Zaklju&#269;ujemo da je taj redak TAJNO, 
te da je to prvi redak. Tako&#273;er je vrlo vjerojatno da je segment PIS 
dio klju&#269;a, pa ga pomaknimo u drugi redak. Tako dobivamo: 
<pre><font size="+1" color=990099>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; T   A   J   N   O

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; P   I   S 

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;     L   M       R
</font></pre>
Odavde se vrlo vjerojatnom &#269;ini pretpostavka da je klju&#269;na rije&#269; 
TAJNOPIS. Popunimo kvadrat i provjerimo pretpostavku: 
<pre><font size="+1" color=990099>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; T   A   J   N   O

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; P   I   S   B   C
  
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; D   E   F   G   H

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; K   L   M   Q   R

&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; U   V   X   Y   Z
</font></pre>
De&#353;ifriranjem dobivamo:
<pre><font size="+1" color=990000>PR EM DA SA MP LA YF AI R nije nikad tvrdio
da je pronalaza&#269; te &#353;ifre, ona je u &#382;argonu
Ministarstva rata dobila naziv Playfairova
&#353;ifra i taj <font color=DDDD33>x</font> joj <font color=DDDD33>x</font> je naziv ostao do danas <font color=DDDD33>x</font>.
</font></pre>

<p>

<hr size=2 noshade>

<b><font size="-1" face="Verdana">
<a href="vigener.html">[Prethodno poglavlje]</a> &nbsp; 
<a href="hill.html">[Sljede&#263;e poglavlje]</a> &nbsp; 
<a href="kriptografija.html">[Sadr&#382;aj]</a>
</font></b>

<hr size=2 noshade>


<table border="0" width="100%">
<tr valign="bottom">
<td>
<a href="../kript.html">Web stranica kolegija <em>Kriptografija</em></a>
</td>

<td align="right">
<a href="../index.html"><em>Andrej Dujella</em> - osobna stranica</a>
</td>
</tr>
</table>

<!-- Start eXTReMe Non Public Tracker Code V3/5
Login:    duje
Help:     https://www.extremetracking.com -->
<script type="text/javascript"><!--
EXs=screen;EXw=EXs.width;navigator.appName!="Netscape"?
EXb=EXs.colorDepth:EXb=EXs.pixelDepth;
navigator.javaEnabled()==1?EXjv="y":EXjv="n";
EXd=document;EXw?"":EXw="na";EXb?"":EXb="na";
location.protocol=="https:"?EXprot="https":EXprot="http";
top.document.referrer?EXref=top.document.referrer:EXref=EXd.referrer;
EXd.write("<img src="+EXprot+"://nht-2.extreme-dm.com",
"/n2.g?login=duje&amp;url="+escape(document.URL)+"&amp;pv=&amp;",
"jv="+EXjv+"&amp;j=y&amp;srw="+EXw+"&amp;srb="+EXb+"&amp;",
"l="+escape(EXref)+" height=1 width=1>");//-->
</script><noscript><div id="nneXTReMe"><img height="1" width="1" alt=""
src="http://nht-2.extreme-dm.com/n2.g?login=duje&amp;url=nojs&amp;j=n&amp;jv=n&amp;pv=" />
</div></noscript>
<!-- End eXTReMe Non Public Tracker Code -->

</body>
</html>

